Map<int, int> pageToFirstSurahMap = {
  1: 1, // الفاتحة
  2: 2, // البقرة
  50: 3, // آل عمران
  77: 4, // النساء
  106: 5, // المائدة
  128: 6, // الأنعام
  151: 7, // الأعراف
  177: 8, // الأنفال
  187: 9, // التوبة
  208: 10, // يونس
  221: 11, // هود
  235: 12, // يوسف
  249: 13, // الرعد
  255: 14, // إبراهيم
  262: 15, // الحجر
  267: 16, // النحل
  282: 17, // الإسراء
  293: 18, // الكهف
  305: 19, // مريم
  312: 20, // طه
  322: 21, // الأنبياء
  332: 22, // الحج
  342: 23, // المؤمنون
  350: 24, // النور
  359: 25, // الفرقان
  367: 26, // الشعراء
  377: 27, // النمل
  385: 28, // القصص
  396: 29, // العنكبوت
  404: 30, // الروم
  411: 31, // لقمان
  418: 32, // السجدة
  422: 33, // الأحزاب
  428: 34, // سبأ
  434: 35, // فاطر
  440: 36, // يس
  446: 37, // الصافات
  453: 38, // ص
  458: 39, // الزمر
  467: 40, // غافر
  477: 41, // فصلت
  483: 42, // الشورى
  489: 43, // الزخرف
  496: 44, // الدخان
  499: 45, // الجاثية
  502: 46, // الأحقاف
  507: 47, // محمد
  511: 48, // الفتح
  515: 49, // الحجرات
  518: 50, // ق
  520: 51, // الذاريات
  523: 52, // الطور
  526: 53, // النجم
  528: 54, // القمر
  531: 55, // الرحمن
  534: 56, // الواقعة
  537: 57, // الحديد
  542: 58, // المجادلة
  545: 59, // الحشر
  549: 60, // الممتحنة
  551: 61, // الصف
  553: 62, // الجمعة
  554: 63, // المنافقون
  556: 64, // التغابن
  558: 65, // الطلاق
  560: 66, // التحريم
  562: 67, // الملك
  564: 68, // القلم
  566: 69, // الحاقة
  568: 70, // المعارج
  570: 71, // نوح
  572: 72, // الجن
  574: 73, // المزمل
  575: 74, // المدثر
  577: 75, // القيامة
  578: 76, // الإنسان
  580: 77, // المرسلات
  582: 78, // النبأ
  583: 79, // النازعات
  585: 80, // عبس
  586: 81, // التكوير
  587: 82, // الانفطار (سورة المطففين 83 تبدأ في نفس الصفحة)
  588: 83, // الانشقاق
  589: 84, // البروج
  590: 85, // الطارق
  591: 86, // الأعلى (سورة الغاشية 88 تبدأ في نفس الصفحة)
  592: 88, // الفجر
  593: 89, // البلد
  594: 90, // الشمس
  595: 91, // الليل (سورة الضحى 93 تبدأ في نفس الصفحة)
  596: 93, // الشرح (سورة التين 95 تبدأ في نفس الصفحة)
  597: 95, // العلق
  598: 97, // القدر (سورة البينة 98 تبدأ في نفس الصفحة)
  599: 99, // الزلزلة (سورة العاديات 100 تبدأ في نفس الصفحة)
  600: 101, // القارعة (سورة التكاثر 102 تبدأ في نفس الصفحة)
  601: 103, // العصر (سورة الهمزة 104 تبدأ في نفس الصفحة)
  602: 106, // الفيل (سورة قريش 106 تبدأ في نفس الصفحة)
  603:
      109, // الماعون (سورة الكوثر 108، الكافرون 109، النصر 110، المسد 111 تبدأ كلها في نفس الصفحة 603)
  604: 112, // الإخلاص (سورة الفلق 113، الناس 114 تبدأ كلها في نفس الصفحة 604)
};
int getSurahFromPage(int page) {
  int surah = 1;
  for (var entry in pageToFirstSurahMap.entries) {
    if (page >= entry.key) {
      surah = entry.value;
    } else {
      break;
    }
  }
  return surah;
}
